## Baby Names! 
* Import Social Security card applications with the goal of hopefully determining and assigning gender to most actors, crew members, and producers
* Will use baby names from 1920 to present, in 30-year increments
* May need to add a third column for names that appear in lists for both genders
* I think these are all babies? Maybe they include adults applying for Social Security cards as well. 
* Curate final dataset with unique values only and create new .csv file to use in project and share with the world!

In [1]:
import csv
import pandas as pd
import numpy as np

In [ ]:
# .txt files I'd like to use
# 1920, 1950, 1980, 2010, 2017 (latest update)

In [2]:
f = open('yob1920.txt', 'r')
reader = csv.reader(f)

In [3]:
names_1920 = pd.read_csv('yob1920.txt', header=None)
names_1920.head()

          0  1      2
0      Mary  F  70980
1   Dorothy  F  36643
2     Helen  F  35097
3  Margaret  F  27997
4      Ruth  F  26101

In [4]:
names_1920.shape

(10755, 3)

In [5]:
names_1920.columns = ['name', 'gender', 'xyz']

In [6]:
names_1920.tail()

           name gender  xyz
10750     Zearl      M    5
10751  Zeferino      M    5
10752      Zeke      M    5
10753      Zera      M    5
10754   Zygmont      M    5

In [7]:
names_1920.drop('xyz', axis=1, inplace=True)

In [9]:
names_1920.replace({'F': 1, 'M': 0}, inplace=True)
names_1920.head()

       name  gender
0      Mary       1
1   Dorothy       1
2     Helen       1
3  Margaret       1
4      Ruth       1

#### Clean baby name df function
* Assign column names
* Drop the number of babies contained in column `xyz` 
* Change genders to binary
    * `F` $\rightarrow$ `1`
    * `M` $\rightarrow$ `0`

In [13]:
def clean_baby_df(df):
    df.columns = ['name', 'gender', 'xyz']
    df.drop('xyz', axis=1, inplace=True)
    df.gender.replace({'F': 1, 'M': 0}, inplace=True)
    # return df

In [16]:
# def txt_to_csv_to_clean_df(txt_file, df_name):
#     f = open(txt_file, 'r')
#     reader = csv.reader(f)
#     df_name = pd.read_csv(txt_file, header=None)
#     df_name.columns = ['name', 'gender', 'xyz']
#     df_name.drop('xyz', axis=1)
#     df_name.gender.replace({'F': 1, 'M': 0})

# this isn't working

In [11]:
f = open('yob1950.txt', 'r')
reader = csv.reader(f)
names_1950 = pd.read_csv('yob1950.txt')
clean_baby_df(names_1950)
names_1950.head()

       name  gender
0      Mary       1
1  Patricia       1
2   Barbara       1
3     Susan       1
4     Nancy       1

In [12]:
f = open('yob1980.txt', 'r')
reader = csv.reader(f)
names_1980 = pd.read_csv('yob1980.txt')
clean_baby_df(names_1980)

            name  gender
0         Amanda       1
1        Jessica       1
2        Melissa       1
3          Sarah       1
4        Heather       1
5         Nicole       1
6            Amy       1
7      Elizabeth       1
8       Michelle       1
9       Kimberly       1
10        Angela       1
11     Stephanie       1
12       Tiffany       1
13     Christina       1
14          Lisa       1
15       Rebecca       1
16       Crystal       1
17         Kelly       1
18          Erin       1
19         Laura       1
20         Amber       1
21        Rachel       1
22         Jamie       1
23         April       1
24          Mary       1
25          Sara       1
26        Andrea       1
27       Shannon       1
28         Megan       1
29         Emily       1
...          ...     ...
19414     Waheed       0
19415     Wallie       0
19416    Warnell       0
19417      Wells       0
19418     Weslee       0
19419     Westen       0
19420    Westlee       0
19421   Wilberto       0
19422     Wilder       0
19423    Wilkins       0
19424   Willison       0
19425     Winson       0
19426     Woodie       0
19427      Worth       0
19428      Wyeth       0
19429       Yari       0
19430        Yaw       0
19431      Yohei       0
19432       York       0
19433      Yuval       0
19434     Yvonne       0
19435   Zackaria       0
19436     Zackry       0
19437      Zaire       0
19438     Zalman       0
19439     Zedric       0
19440       Zell       0
19441      Zenas       0
19442    Zhivago       0
19443        Zoe       0

[19444 rows x 2 columns]

In [14]:
f = open('yob2010.txt', 'r')
reader = csv.reader(f)
names_2010 = pd.read_csv('yob2010.txt')
clean_baby_df(names_2010)
names_2010.head()

     name  gender
0  Sophia       1
1    Emma       1
2  Olivia       1
3     Ava       1
4   Emily       1

In [16]:
f = open('yob2017.txt', 'r')
reader = csv.reader(f)
names_2017 = pd.read_csv('yob2017.txt')
clean_baby_df(names_2017)
names_2017.head()

       name  gender
0    Olivia       1
1       Ava       1
2  Isabella       1
3    Sophia       1
4       Mia       1

In [ ]:
# Check for names that show up in both genders

def check_for_gender_neutral_names(df1, df2):
    gender_neutral_names = []

In [ ]:
# big_name_df = pd.concat([names_1920, names_1950, names_1980, names_2010, names_2017], axis=0)
# concatenated.drop_duplicates(cols='name')

# need to check for gender neutral names before merging all dfs